package com.example.musicplayer.pojo;

import java.util.List;

public class MusicInfo {

    /**
     * data : [{"type":"netease","link":"http://music.163.com/#/song?id=1897927515","songid":1897927515,"title":"十年 (OT: 明年今日)","author":"陈奕迅","lrc":"[00:00.000] 作词 : Albert Leung\n[00:01.000] 作曲 : 陈小霞\n[00:02.000] 编曲 : 陈辉阳\n[00:16.199]如果那两个字没有颤抖\n[00:19.209]\n[00:19.948]我不会发现我难受\n[00:22.205]\n[00:24.691]怎么说出口\n[00:25.702]\n[00:27.691]也不过是分手\n[00:29.448]\n[00:31.443]如果对于明天没有要求\n[00:34.708]\n[00:35.702]牵牵手就像旅游\n[00:37.445]\n[00:38.948]成千上万个门口\n[00:40.645]\n[00:41.894]总有一个人要先走\n[00:46.137]\n[00:47.894]怀抱既然不能逗留\n[00:50.889]\n[00:52.139]何不在离开的时候\n[00:54.136]\n[00:55.147]一边享受 一边泪流\n[01:00.356]\n[01:02.353]十年之前\n[01:03.348]\n[01:04.345]我不认识你 你不属于我\n[01:06.862]\n[01:08.356]我们还是一样\n[01:09.857]\n[01:11.606]陪在一个陌生人左右\n[01:13.360]\n[01:14.613]走过渐渐熟悉的街头\n[01:16.353]\n[01:17.594]十年之后\n[01:18.854]\n[01:19.109]我们是朋友 还可以问候\n[01:22.111]\n[01:23.855]只是那种温柔\n[01:24.855]\n[01:26.095]再也找不到拥抱的理由\n[01:28.110]\n[01:30.109]情人最后难免沦为朋友\n[01:35.067]\n[01:57.062]怀抱既然不能逗留\n[02:00.057]\n[02:00.810]何不在离开的时候\n[02:03.053]\n[02:03.821]一边享受 一边泪流\n[02:10.055]\n[02:10.809]十年之前\n[02:12.511]\n[02:13.506]我不认识你 你不属于我\n[02:16.515]\n[02:17.254]我们还是一样\n[02:18.757]\n[02:19.510]陪在一个陌生人左右\n[02:22.515]\n[02:23.016]走过渐渐熟悉的街头\n[02:26.018]\n[02:26.764]十年之后\n[02:28.760]\n[02:29.260]我们是朋友 还可以问候\n[02:31.758]\n[02:32.525]只是那种温柔\n[02:34.255]\n[02:35.766]再也找不到拥抱的理由\n[02:37.515]\n[02:38.275]情人最后难免沦为朋友\n[02:45.504]\n[02:48.511]直到和你做了多年朋友\n[02:52.005]\n[02:53.517]才明白我的眼泪\n[02:55.017]\n[02:56.011]不是为你而流\n[02:58.766]\n[03:10.014]也为别人而流\n","url":"http://m701.music.126.net/20221130115443/078c685f1b18e5c78b8cdc1db84a3c37/jdymusic/obj/wo3DlMOGwrbDjj7DisKw/11794847625/9272/cdff/8545/3297550f1cdac107f969cb608abe8c6f.mp3","pic":"http://p1.music.126.net/RdBFQahX4RNsy_fGPva3YQ==/109951166656400274.jpg?param=300x300"},{"type":"netease","link":"http://music.163.com/#/song?id=66842","songid":66842,"title":"十年","author":"陈奕迅","lrc":"[00:00.000] 作曲 : 陈小霞\n[00:01.000] 编曲 : 陈辉阳\n[00:02.000] 制作人 : 陈小霞/陈辉阳\n[00:03.000] 录音师 : 陈忠宏/亚祥 (HK)\n[00:04.000] 录音室 : 白金/AVON (HK)\n[00:05.000] 混音工程师 : 王家栋\n[00:06.000] 混音录音室 : 节奏\n[00:15.54]如果那两个字没有颤抖\n[00:19.26]我不会发现 我难受\n[00:22.64]怎么说出口\n[00:26.08]也不过是分手\n[00:30.77]如果对于明天没有要求\n[00:34.85]牵牵手就像旅游\n[00:37.96]成千上万个门口\n[00:41.70]总有一个人要先走\n[00:47.39]怀抱既然不能逗留\n[00:50.89]何不在离开的时候\n[00:53.77]一边享受 一边泪流\n[01:00.93]十年之前\n[01:02.95]我不认识你\n[01:04.89]你不属于我\n[01:06.87]我们还是一样\n[01:09.24]陪在一个陌生人左右\n[01:13.12]走过渐渐熟悉的街头\n[01:16.46]十年之后\n[01:18.33]我们是朋友\n[01:20.31]还可以问候\n[01:22.27]只是那种温柔\n[01:24.70]再也找不到拥抱的理由\n[01:28.64]情人最后难免沦为朋友\n[01:57.07]怀抱既然不能逗留\n[02:00.54]何不在离开的时候\n[02:03.58]一边享受 一边泪流\n[02:10.63]十年之前\n[02:12.65]我不认识你\n[02:14.63]你不属于我\n[02:16.50]我们还是一样\n[02:18.98]陪在一个陌生人左右\n[02:22.72]走过渐渐熟悉的街头\n[02:26.15]十年之后我们是朋友\n[02:30.04]还可以问候\n[02:32.01]只是那种温柔\n[02:34.38]再也找不到拥抱的理由\n[02:38.27]情人最后难免沦为朋友\n[02:48.19]直到和你做了多年朋友\n[02:52.38]才明白我的眼泪\n[02:55.21]不是为你而流\n[02:58.99]也为别人而流\n","url":null,"pic":"http://p1.music.126.net/WF9SAVpoTbueroj7CLoKKg==/109951163028210664.jpg?param=300x300"},{"type":"netease","link":"http://music.163.com/#/song?id=31877628","songid":31877628,"title":"十年(Live)","author":"韩红,陈奕迅","lrc":"[00:00.000] 作词 : 林夕\n[00:01.000] 作曲 : 陈小霞\n[00:19.83]韩：如果那两个字没有颤抖\n[00:26.91]我不会发现我难受\n[00:29.70]\n[00:30.22]怎么说出口 也不过是分手\n[00:36.06]\n[00:38.56]如果对于明天没有要求\n[00:42.11]\n[00:42.63]牵牵手就像旅游\n[00:45.68]成千上万个门口\n[00:47.83]\n[00:49.52]总有一个人要先走\n[00:52.23]\n[00:52.88]陈：怀抱既然不能逗留\n[00:57.92]\n[00:58.68]何不在离开的时候\n[01:00.90]\n[01:01.67]一边享受\n[01:02.82]\n[01:04.27]一边泪流\n[01:07.30]合：十年之前\n[01:10.71]我不认识你 你不属于我\n[01:14.55]我们还是一样\n[01:16.35]\n[01:16.97]陪在一个陌生人左右\n[01:19.84]\n[01:20.84]走过渐渐熟悉的街头\n[01:24.34]十年之后我们是朋友\n[01:28.11]还可以问候\n[01:29.98]只是那种温柔\n[01:31.89]\n[01:32.44]再也找不到拥抱的理由\n[01:35.63]\n[01:36.28]情人最后难免沦为朋友\n[01:42.00]\n[02:00.70]陈：如果那两个字没有颤抖\n[02:07.67]我不会发现 我难受\n[02:10.34]\n[02:10.91]怎么说出口 也不过是分手\n[02:16.40]\n[02:19.27]如果对于明天没有要求\n[02:23.11]牵牵手就像旅游\n[02:26.07]成千上万个门口\n[02:28.11]\n[02:30.05]总有一个人要先走\n[02:32.87]怀抱既然不能逗留\n[02:38.43]\n[02:39.29]何不在离开的时候\n[02:41.50]\n[02:42.22]一边享受\n[02:43.78]\n[02:44.86]一边泪流\n[02:48.65]\n[02:49.34]十年之前\n[02:51.31]我不认识你 你不属于我\n[02:55.19]我们还是一样\n[02:57.03]\n[02:57.65]陪在一个陌生人左右\n[03:00.42]\n[03:01.50]走过渐渐熟悉的街头\n[03:04.83]十年之后 我们是朋友\n[03:08.23]\n[03:08.75]还可以问候\n[03:10.69]只是那种温柔\n[03:13.05]再也找不到拥抱的理由\n[03:16.18]\n[03:16.92]情人最后难免沦为朋友\n[03:21.83]\n[03:28.42]合：十年之前\n[03:37.28]\n[03:37.79]我不认识你 你不属于我\n[03:41.65]我们还是一样\n[03:43.46]\n[03:44.01]陪在一个陌生人左右\n[03:46.75]\n[03:47.97]走过渐渐熟悉的街头\n[03:51.35]十年之后我们是朋友\n[03:55.15]还可以问候\n[03:57.12]只是那种温柔\n[03:58.95]\n[03:59.50]再也找不到拥抱的理由\n[04:02.67]\n[04:03.39]情人最后难免沦为朋友\n[04:09.35]\n[04:11.28]韩：直到和你做了多年朋友\n[04:17.05]\n[04:17.86]才明白我的眼泪\n[04:20.52]陈：不是为你而流\n[04:23.04]合：也为别人而流\n","url":"http://m10.music.126.net/20221130115443/bb7ad000df9a9a44aff1843342907467/ymusic/8dfe/a85c/ce67/9a5315e4db0d12193d21c5cf834eefab.mp3","pic":"http://p1.music.126.net/C69zO6_wapO94TOE5DnIBg==/2941193605503524.jpg?param=300x300"},{"type":"netease","link":"http://music.163.com/#/song?id=1934630654","songid":1934630654,"title":"十年（女声温柔版）","author":"小不点","lrc":"[00:15.960]如果那两个字没有颤抖\n[00:19.800]我不会发现我难受\n[00:23.130]怎么说出口也不过是分手\n[00:31.380]如果对于明天没有要求\n[00:35.430]牵牵手就像旅游\n[00:38.370]成千上万个门口\n[00:42.360]总有一个人要先走\n[00:48.030]怀抱既然不能逗留\n[00:51.450]何不在离开的时候\n[00:54.390]一边享受\n[00:57.030]一边泪流\n[01:01.500]十年之前\n[01:03.570]我不认识你你不属于我\n[01:07.470]我们还是一样\n[01:09.870]陪在一个陌生人左右\n[01:13.680]走过渐渐熟悉的街头\n[01:17.040]十年之后我们是朋友\n[01:20.910]还可以问候\n[01:22.860]只是那种温柔\n[01:25.290]再也找不到拥抱的理由\n[01:29.160]情人最后难免沦为朋友\n[01:57.690]怀抱既然不能逗留\n[02:01.170]何不在离开的时候\n[02:04.050]一边享受\n[02:06.660]一边泪流\n[02:11.190]十年之前\n[02:13.260]我不认识你你不属于我\n[02:17.100]我们还是一样\n[02:19.530]陪在一个陌生人左右\n[02:23.340]走过渐渐熟悉的街头\n[02:26.730]十年之后我们是朋友\n[02:30.660]还可以问候\n[02:32.550]只是那种温柔\n[02:34.950]再也找不到拥抱的理由\n[02:38.820]情人最后难免沦为朋友\n[02:48.840]直到和你做了多年朋友\n[02:52.860]才明白我的眼泪\n[02:55.860]不是为你而流\n[02:59.730]也为别人而流\n","url":"http://m701.music.126.net/20221130115443/41f62bd56b86a69087089f01b9f7f65c/jdymusic/obj/wo3DlMOGwrbDjj7DisKw/13791808935/79fa/88fa/1c64/37056d501c910d56b3399784872bef25.mp3","pic":"http://p1.music.126.net/zeYS8plO32rz2xvZF8RUmg==/109951167060945932.jpg?param=300x300"},{"type":"netease","link":"http://music.163.com/#/song?id=1898033375","songid":1898033375,"title":"十年","author":"Lao吳","lrc":"[00:00.000] 作词 : 陈奕迅\n[00:01.000] 作曲 : 陈小霞\n[00:02.000] 编曲 : 陈辉阳\n[00:17.448]如果那两个字没有颤抖\n[00:21.453]我不会发现 我难受\n[00:24.694]怎么说出口\n[00:28.455]也不过是分手\n[00:32.946]如果对于明天没有要求\n[00:36.952]牵牵手就像旅游\n[00:39.949]成千上万个门口\n[00:43.700]总有一个人要先走\n[00:49.703]怀抱既然不能逗留\n[00:52.698]何不在离开的时候\n[00:55.947]一边享受 一边泪流\n[01:03.205]十年之前\n[01:05.202]我不认识你\n[01:06.953]你不属于我\n[01:08.950]我们还是一样\n[01:11.447]陪在一个陌生人左右\n[01:15.198]走过渐渐熟悉的街头\n[01:18.448]十年之后\n[01:20.444]我们是朋友\n[01:22.453]还可以问候\n[01:24.450]只是那种温柔\n[01:26.946]再也找不到拥抱的理由\n[01:30.697]情人最后难免沦为朋友\n[01:59.200]怀抱既然不能逗留\n[02:02.695]何不在离开的时候\n[02:05.702]一边享受 一边泪流\n[02:12.702]十年之前\n[02:14.699]我不认识你\n[02:16.696]你不属于我\n[02:18.704]我们还是一样\n[02:20.956]陪在一个陌生人左右\n[02:24.950]走过渐渐熟悉的街头\n[02:28.399]十年之后我们是朋友\n[02:32.147]还可以问候\n[02:34.156]只是那种温柔\n[02:36.652]再也找不到拥抱的理由\n[02:40.404]情人最后难免沦为朋友\n[02:50.400]直到和你做了多年朋友\n[02:54.405]才明白我的眼泪\n[02:57.400]不是为你而流\n[03:01.149]也为别人而流\n","url":"http://m801.music.126.net/20221130115443/56db6548394965c9924a390408ce210f/jdymusic/obj/wo3DlMOGwrbDjj7DisKw/11799436621/6bda/5adf/7769/ad07feca9ad1858e052564d7befcf91a.mp3","pic":"http://p1.music.126.net/OHXiGu3ko92EnwJQXXDCFA==/109951166576164576.jpg?param=300x300"},{"type":"netease","link":"http://music.163.com/#/song?id=1842025914","songid":1842025914,"title":"这世界那么多人","author":"莫文蔚","lrc":"[00:00.000] 作词 : 王海涛\n[00:01.000] 作曲 : Akiyama Sayuri\n[00:02.000] 编曲 : 彭飞\n[00:03.000] 制作人 : 荒井十一/彭飞\n[00:18.754]这世界有那么多人\n[00:25.191]人群里 敞着一扇门\n[00:31.197]我迷朦的眼睛里长存\n[00:38.007]初见你  蓝色清晨\n[00:45.179]这世界有那么多人\n[00:50.980]多幸运 我有个我们\n[00:57.976]这悠长命运中的晨昏\n[01:04.591]常让我 望远方出神\n[01:12.251]灰树叶飘转在池塘\n[01:18.179]看飞机轰的一声去远乡\n[01:24.683]光阴的长廊 脚步声叫嚷\n[01:31.230]灯一亮 无人的空荡\n[01:39.027]晚风中闪过 几帧从前啊\n[01:45.061]飞驰中旋转 已不见了吗\n[01:52.099]远光中走来 你一身晴朗\n[01:59.084]身旁那么多人 可世界不声 不响\n[02:11.842]这世界有那么多人\n[02:18.705]多幸运 我有个我们\n[02:25.067]这悠长命运中的晨昏\n[02:31.287]常让我 望远方出神\n[02:38.903]灰树叶飘转在池塘\n[02:45.324]看飞机轰的一声去远乡\n[02:51.286]光阴的长廊 脚步声叫嚷\n[02:57.931]灯一亮 无人的空荡\n[03:05.408]晚风中闪过 几帧从前啊\n[03:12.195]飞驰中旋转 已不见了吗\n[03:18.442]远光中走来 你一身晴朗\n[03:25.538]身旁那么多人 可世界不声 不响\n[03:35.622]笑声中浮过 几张旧模样\n[03:41.803]留在梦田里 永远不散场\n[03:48.489]暖光中醒来 好多话要讲\n[03:55.747]世界那么多人 可是它不声 不响\n[04:07.895]这世界有那么个人\n[04:14.348]活在我 飞扬的青春\n[04:21.439]在泪水里浸湿过的长吻\n[04:27.966]常让我 想啊想出神\n[04:29.956] 弦乐 : 彭飞\n[04:31.946] 吉他 : 胡洋\n[04:33.936] 曼陀林 : 彭飞\n[04:35.926] 鼓 : 荒井十一\n[04:37.916] 录音室 : Studio 21A\n[04:39.906] 录音师 : 倪涵文\n[04:41.896] 混音室 : Studio 21A\n[04:43.886] 混音师 : 周天澈\n[04:45.876] 母带工程师 : 周天澈\n","url":"http://m801.music.126.net/20221130115443/780f3b9f935d984d860edd32045a0463/jdymusic/obj/wo3DlMOGwrbDjj7DisKw/14096407591/ba3d/5a07/9eea/2f6a725e7b6519eb18818cd7bb640b7f.mp3","pic":"http://p1.music.126.net/LOTxqRjFm03VJEOHJbUqMw==/109951165944804127.jpg?param=300x300"},{"type":"netease","link":"http://music.163.com/#/song?id=1997309677","songid":1997309677,"title":"十年（热门原声）","author":"冰冷的心","lrc":"[00:00.000] 作词 : 无\n[00:00.000] 作曲 : 无\n[00:00.000] 编曲 : 无\n[00:00.00] 怀抱既然不能逗留\n[00:24.29]何不在离开的时候\n[00:27.24]一边享受 一边泪流\n[00:34.29]十年之前\n[00:36.33]我 不认识你你不属于我\n[00:40.13]我们还是一样\n[00:42.54]陪在一个陌生人左右\n[00:46.38]走过渐渐熟悉的街头\n[00:49.64]十年之后\n[00:51.61]我们是朋友 还可以问候\n[00:55.45]只是那种温柔\n[00:57.86]再也找不到拥抱的理由\n[01:01.60]情人最后难免 沦为 朋友\n","url":"http://m701.music.126.net/20221130115443/5e531b3aa6b5ac436aeb6c2ac64c3974/jdymusic/obj/wo3DlMOGwrbDjj7DisKw/22035361877/bac5/9078/ddd8/d88b83e9d260b393be24e6dfafd3273a.mp3","pic":"http://p2.music.126.net/9LMQHGlM-ldS0Kiqpm85lw==/109951168048646344.jpg?param=300x300"},{"type":"netease","link":"http://music.163.com/#/song?id=34040853","songid":34040853,"title":"十年","author":"赵丽颖","lrc":"[00:16.19]如果那两个字没有颤抖\n[00:20.13]我不会发现 我难受\n[00:23.58]怎么说出口\n[00:27.19]也不过是分手\n[00:31.93]如果对于明天没有要求\n[00:35.79]牵牵手就像旅游\n[00:38.76]成千上万个门口\n[00:42.66]总有一个人要先走\n[00:48.21]怀抱既然不能逗留\n[00:51.68]何不在离开的时候\n[00:54.85]一边享受 一边泪流\n[01:01.94]十年之前\n[01:03.90]我不认识你 你不属于我\n[01:07.69]我们还是一样\n[01:10.15]陪在一个陌生人左右\n[01:13.91]走过渐渐熟悉的街头\n[01:17.39]十年之后\n[01:19.43]我们是朋友 还可以问候\n[01:23.25]只是那种温柔\n[01:25.61]再也找不到拥抱的理由\n[01:29.50]情人最后难免沦为朋友\n[01:58.13]怀抱既然不能逗留\n[02:01.54]何不在离开的时候\n[02:04.46]一边享受 一边泪流\n[02:11.54]十年之前\n[02:13.60]我不认识你 你不属于我\n[02:17.37]我们还是一样\n[02:19.90]陪在一个陌生人左右\n[02:23.55]走过渐渐熟悉的街头\n[02:27.05]十年之后\n[02:29.10]我们是朋友 还可以问候\n[02:32.87]只是那种温柔\n[02:35.46]再也找不到拥抱的理由\n[02:39.23]情人最后难免沦为朋友\n[02:47.29]直到和你做了多年朋友\n[02:51.39]才明白我的眼泪\n[02:54.19]不是为你而流\n[02:58.28]也为别人而流\n[03:01.92]\n","url":"http://m10.music.126.net/20221130115443/1784a3bc908978c33f51aba4a6493a7f/ymusic/0f6d/56b9/d230/3ad738cf9cf01ac6d2a36c6785f3d039.mp3","pic":"http://p2.music.126.net/kKhrHrRBgHg-I3jQm6tPlA==/3274345627819236.jpg?param=300x300"},{"type":"netease","link":"http://music.163.com/#/song?id=1999272478","songid":1999272478,"title":"十年（×0.9环绕版）","author":"小意","lrc":"","url":"http://m701.music.126.net/20221130115443/d9b0b67e32bebae525dbd01745ffffa4/jdymusic/obj/wo3DlMOGwrbDjj7DisKw/22211464800/b3b3/2daf/0ddc/55fda7744da7b0deebca94164f34ee92.mp3","pic":"http://p2.music.126.net/LMy2v4Ag-DKANfYu976rlQ==/109951168062354042.jpg?param=300x300"},{"type":"netease","link":"http://music.163.com/#/song?id=446875807","songid":446875807,"title":"十年","author":"梁朝伟,李宇春","lrc":"[00:00.000] 作词 : 林夕\n[00:01.000] 作曲 : 陈小霞\n[00:02.000] 编曲 : 唐汉霄\n[00:08.910]男：\n[00:09.650]\n[00:10.590]十年之后\n[00:12.510]\n[00:13.020]我们是朋友还可以问候\n[00:17.800]只是那种温柔\n[00:20.840]再也找不到拥抱的理由\n[00:25.560]情人最后难免沦为朋友\n[00:34.870]\n[00:48.850]女：\n[00:49.330]\n[00:50.730]如果那两个字没有颤抖\n[00:54.990]我不会发现我难受\n[00:58.660]怎么说出口\n[01:00.630]\n[01:02.880]也不过是分手\n[01:04.920]\n[01:07.390]男：\n[01:08.040]如果对于明天没有要求\n[01:11.710]\n[01:12.350]牵牵手就像旅游\n[01:15.530]成千上万个门口\n[01:17.990]\n[01:19.920]总有一个人要先走\n[01:22.880]\n[01:24.240]女：\n[01:24.720]\n[01:26.400]怀抱既然不能逗留\n[01:30.050]何不在离开的时候\n[01:33.280]一边享受一边泪流\n[01:40.470]\n[01:41.300]十年之前\n[01:43.530]我不认识你你不属于我\n[01:47.670]我们还是一样\n[01:50.400]陪在一个陌生人左右\n[01:54.660]走过渐渐熟悉的街头\n[01:58.130]男：\n[01:58.480]十年之后\n[02:00.650]我们是朋友还可以问候\n[02:04.810]只是那种温柔\n[02:07.500]再也找不到拥抱的理由\n[02:11.710]情人最后难免沦为朋友\n[02:18.500]\n[02:37.240]怀抱既然不能逗留\n[02:40.870]何不在离开的时候\n[02:43.700]合：\n[02:43.900]一边享受一边泪流\n[02:51.140]\n[02:52.000]十年之前\n[02:54.170]我不认识你你不属于我\n[02:58.430]我们还是一样\n[03:01.100]陪在一个陌生人左右\n[03:04.520]男：\n[03:05.330]走过渐渐熟悉的街头\n[03:09.070]十年之后\n[03:11.010]合：\n[03:11.430]我们是朋友还可以问候\n[03:15.580]只是那种温柔\n[03:17.860]男：\n[03:18.320]再也找不到拥抱的理由\n[03:22.600]情人最后难免沦为\n[03:26.670]合：\n[03:27.180]朋友\n[03:30.050]男：\n[03:30.550]\n[03:31.320]直到和你做了多年朋友\n[03:35.870]才明白我的眼泪\n[03:39.170]不是为你而流\n[03:41.500]\n[03:43.500]也为别人而流\n","url":"http://m10.music.126.net/20221130115443/81c2fc75078a11989f07cda6ca881486/ymusic/9141/2cd2/6ac8/adc4676fcd3c56598386498fe2516b45.mp3","pic":"http://p2.music.126.net/96FnT-ztJjJkE1EbV-nGcg==/18781857627302141.jpg?param=300x300"}]
     * code : 200
     * error :
     */

    private int code;
    private String error;
    private List<DataBean> data;

    public int getCode() {
        return code;
    }

    public void setCode(int code) {
        this.code = code;
    }

    public String getError() {
        return error;
    }

    public void setError(String error) {
        this.error = error;
    }

    public List<DataBean> getData() {
        return data;
    }

    public void setData(List<DataBean> data) {
        this.data = data;
    }

    public static class DataBean {
        /**
         * type : netease
         * link : http://music.163.com/#/song?id=1897927515
         * songid : 1897927515
         * title : 十年 (OT: 明年今日)
         * author : 陈奕迅
         * lrc : [00:00.000] 作词 : Albert Leung
         [00:01.000] 作曲 : 陈小霞
         [00:02.000] 编曲 : 陈辉阳
         [00:16.199]如果那两个字没有颤抖
         [00:19.209]
         [00:19.948]我不会发现我难受
         [00:22.205]
         [00:24.691]怎么说出口
         [00:25.702]
         [00:27.691]也不过是分手
         [00:29.448]
         [00:31.443]如果对于明天没有要求
         [00:34.708]
         [00:35.702]牵牵手就像旅游
         [00:37.445]
         [00:38.948]成千上万个门口
         [00:40.645]
         [00:41.894]总有一个人要先走
         [00:46.137]
         [00:47.894]怀抱既然不能逗留
         [00:50.889]
         [00:52.139]何不在离开的时候
         [00:54.136]
         [00:55.147]一边享受 一边泪流
         [01:00.356]
         [01:02.353]十年之前
         [01:03.348]
         [01:04.345]我不认识你 你不属于我
         [01:06.862]
         [01:08.356]我们还是一样
         [01:09.857]
         [01:11.606]陪在一个陌生人左右
         [01:13.360]
         [01:14.613]走过渐渐熟悉的街头
         [01:16.353]
         [01:17.594]十年之后
         [01:18.854]
         [01:19.109]我们是朋友 还可以问候
         [01:22.111]
         [01:23.855]只是那种温柔
         [01:24.855]
         [01:26.095]再也找不到拥抱的理由
         [01:28.110]
         [01:30.109]情人最后难免沦为朋友
         [01:35.067]
         [01:57.062]怀抱既然不能逗留
         [02:00.057]
         [02:00.810]何不在离开的时候
         [02:03.053]
         [02:03.821]一边享受 一边泪流
         [02:10.055]
         [02:10.809]十年之前
         [02:12.511]
         [02:13.506]我不认识你 你不属于我
         [02:16.515]
         [02:17.254]我们还是一样
         [02:18.757]
         [02:19.510]陪在一个陌生人左右
         [02:22.515]
         [02:23.016]走过渐渐熟悉的街头
         [02:26.018]
         [02:26.764]十年之后
         [02:28.760]
         [02:29.260]我们是朋友 还可以问候
         [02:31.758]
         [02:32.525]只是那种温柔
         [02:34.255]
         [02:35.766]再也找不到拥抱的理由
         [02:37.515]
         [02:38.275]情人最后难免沦为朋友
         [02:45.504]
         [02:48.511]直到和你做了多年朋友
         [02:52.005]
         [02:53.517]才明白我的眼泪
         [02:55.017]
         [02:56.011]不是为你而流
         [02:58.766]
         [03:10.014]也为别人而流
         * url : http://m701.music.126.net/20221130115443/078c685f1b18e5c78b8cdc1db84a3c37/jdymusic/obj/wo3DlMOGwrbDjj7DisKw/11794847625/9272/cdff/8545/3297550f1cdac107f969cb608abe8c6f.mp3
         * pic : http://p1.music.126.net/RdBFQahX4RNsy_fGPva3YQ==/109951166656400274.jpg?param=300x300
         */

        private String type;
        private String link;
        private int songid;
        private String title;
        private String author;
        private String lrc;
        private String url;
        private String pic;

        public String getType() {
            return type;
        }

        public void setType(String type) {
            this.type = type;
        }

        public String getLink() {
            return link;
        }

        public void setLink(String link) {
            this.link = link;
        }

        public int getSongid() {
            return songid;
        }

        public void setSongid(int songid) {
            this.songid = songid;
        }

        public String getTitle() {
            return title;
        }

        public void setTitle(String title) {
            this.title = title;
        }

        public String getAuthor() {
            return author;
        }

        public void setAuthor(String author) {
            this.author = author;
        }

        public String getLrc() {
            return lrc;
        }

        public void setLrc(String lrc) {
            this.lrc = lrc;
        }

        public String getUrl() {
            return url;
        }

        public void setUrl(String url) {
            this.url = url;
        }

        public String getPic() {
            return pic;
        }

        public void setPic(String pic) {
            this.pic = pic;
        }

        @Override
        public String toString() {
            return "DataBean{" +
                    "type='" + type + '\'' +
                    ", link='" + link + '\'' +
                    ", songid=" + songid +
                    ", title='" + title + '\'' +
                    ", author='" + author + '\'' +
                    ", lrc='" + lrc + '\'' +
                    ", url='" + url + '\'' +
                    ", pic='" + pic + '\'' +
                    '}';
        }
    }

    @Override
    public String toString() {
        return "MusicInfo{" +
                "code=" + code +
                ", error='" + error + '\'' +
                ", data=" + data +
                '}';
    }
}
